{
    "posts": [
        {
            "id": "starting-a-blog",
            "title": "Why I'm Starting a Daily Blog",
            "date": "9/1/2025",
            "image": "https://w6a1hhcupko92e7d.public.blob.vercel-storage.com/images/starting-a-blog.png",
            "article": [
                "## Intro",
                "'The unexamined life is not worth living' - Socrates. Here, I'll try to examine just about everything I know about what I do best, Software Engineering. I'm currently a middling software engineer trying to become the best. I'm a fast learner though, so that's a good start.",
                "'... but when you examine your life... oh that's not fun' - Norm MacDonald. Routinely calling into question your most basic assumptions can be painful. I believe that,  to get good at anything, you should need to go though all the necessary torture. In this case, I'll be learning everything there is to know about software.",
                "## Who the Blog Is For",
                "In all honesty, the blog is mostly for my own benefit. I don't much read blogs. I don't expect to get much or any interest in this blog. This blog exists simply as a creative outlet. ",
                "However, if you (not me) are reading this, then you are surely interested in software. So... maybe heed some second hand knowledge. It's not the real thing but a whiff of it. Useful for getting a taste.",
                "## The Topics I'll Be Covering",
                "This blog aims to examine what I know, what I'm learning, deep into my thoughts. As what I'm learning is usually technology based, that's what the blog will usually be. ",
                "I have a few thoughts as to the initial direction of the blog. I'm trying for a Front-End Developer job so my current learning is aimed at front-end development. The modern state of UI is a good option. By the same token, to understand a problem is the first step to solve it so I'll examine the job market and how to best get a job in 2025. I have some expertise in code optimisation so I'll write a piece on when we should and shouldn't optimise code. Lastly, I think improving performance is an important thing to think about. I'll write on exercise, sleep and diets a little bit. ",
                "## My Target Blog style",
                "From blogs I've read (not many) I really like one written by Tim Ferriss. He is a man who want's to make the most of his life and inspire others to do the same. His style is both deeply personal and professionally polished. It reads like a celebrity newspaper column where it's from a particular perspective but not 'talky' or poorly edited.",
                "## What Success Looks Like",
                "Success in this blog will be if I can make it to 100 days. 100 days, 100 articles, 50,000 edited. The reason for 'daily' as opposed to bi-weekly (my first thought) is that I need a lot of examination in my life. ",
                "## Conclusion",
                "What does Socrates mean when he says we need to examine our lives? Well... I think he means that we should maximise our lives. Not just live for the sake of living but really put effort into our days. Make the most of what we have. I think this blog is the first step towards that goal!"
            ]
        },
        {
            "id": "software-updates",
            "title": "How to Effectively Roll Out Software Updates ",
            "date": "9/15/2025",
            "image": "https://w6a1hhcupko92e7d.public.blob.vercel-storage.com/images/software-updates.png",
            "article": [
                "## Intro",
                "Popular software usually receives frequent updates. In fact, modern software _needs_ to be updated to function. The web browser you are viewing this on needs to be updated. The Operating System on your Phone or Laptop needs to be updated. Standards change, requirements change, bugs emerge and products get new features to fulfil user demands.",
                "Although modern updates are usually extremely well done, understanding how to roll out software updates is a key part of the software lifecycle.",
                "## Fix and Feature Updates",
                "We can split updates into two groups; fixes and features. ",
                "Fixes - things the user shouldn't see (security updates, bug fixes etc). ",
                "Features - things the user should see (new buttons, updated UI etc).",
                "A fix is simple because nobody sees it. The user simply won't see the error any more.",
                "The hard type of update is a feature update. This is because you can annoy users with changes to software they are familiar with. As such, we need to be sensitive to the user. The user trusts you to not break their product. They have a mental map of how everything works so we need to keep it the same. Any time we are changing the app, we need to be tasteful, keep the user informed and be persuasive.",
                "## Strategies for roll out",
                "The easiest type of roll out is to push the update to everyone at once - referred to as 'big-bang'. There are some issues with big-bang such as if there is a major bug that was missed in testing or extremely negative user feedback regarding a feature.",
                "The safer approach is to deploy to a subset of your users. Get feedback and later have a wide release. You can see if you've missed anything with minimal reputational damage. However, this is more expensive to set up and delays updates.",
                "Rule of thumb: big product - phased, small product - all at once.",
                "## The worst update of all time",
                "What would happen if Y2K did happen? What if a huge amount of computers crashed all at once? Well... that did happen. Last year. The 'Crowdstrike Outage'  (19th of July, 2024) was arguably the worst software update of all time and completely avoidable. ",
                "In short, the outage was caused by a security update to Crowdstrike's Falcon product with a logical error. As Falcon has special privilege to low level OS commands, Falcon caused Windows to crash... on over 8.5 million machines.",
                "The fix was issued within hours but by then, the damage was done.",
                "How would you avoid this? Well... don't use a Big-Bang rollout when you have your software running on 8.5 million devices. This was a leadership problem, they did not plan for mistakes to happen.",
                "## Conclusion",
                "Updating Software is _usually_ fairly simple these days. Most software can be frequently updated and feedback is readily available. Big companies value reputation over velocity and have entire teams dedicated to effectively rolling out updates their software. "
            ]
        },
        {
            "id": "phone-server",
            "title": "I'm running this website on my phone!",
            "date": "9/25/2025",
            "image": "https://w6a1hhcupko92e7d.public.blob.vercel-storage.com/images/phone-server.png",
            "article": [
                "## Intro",
                "Ever since I was a child I've enjoyed using things not for their intended purpose. I'd love to watch someone use a brushless drill motor in an electric bike. That's part of the fun of hacking... taking things well beyond what the manufacturer ever imagined. ",
                "Well... I've come want to host this blog and although I don't have a home server right now I still wanted to self host. That's why I'm using a phone!",
                "## Why run a server from an old phone",
                "Paywalls - Look at medium.com. You might think of it as a free space to upload your blog. Oh wait... your blog is now behind a paywall. This is a trend that's not likely to change.",
                "Customisation - If you use a site maker, you are usually locked down to a specific template. If you know how to code front-end, this is doubly frustrating.",
                "Learning Experience- I've personally learned a lot about back-end engineering from doing this. It's really quite easy. ",
                "That said, you'll need to put aside an afternoon to get it set up. ",
                "## Run a Node Server on Android",
                "This is not a tutorial. Tutorials exist already. The basic idea is that you can run Termux, an android terminal emulator which runs on top of your Android OS. It's able to run code directly on your device's kernel but does not have root access.",
                "It runs very slow but my device is a Moto E14 which was £50 from amazon. ",
                "## Better Options (if you have more money)",
                "A common situation is to hire a VM on a server. Or hire and entire server. This is a good option for some but has a monthly subscription attached and usually restrictions on what you're allowed to run.",
                "If you have the money, a raspberry pi is a great cheapish option. It's massively more powerful than a phone, can be expanded with storage, networking etc. However, with a case and charger you're talking in the region of £100. This makes a lot more sense if you plan on self hosting more than just a blog.",
                "## Planned upgrades",
                "The Termux instance is very slow. A better option is to flash an instance of ubuntu server onto the phone. I thought of this but as my only USB-C cable is not a data cable, I can't do it right now.",
                "After I get the R-Pi, I'll set up a few extras. Currently the blog uses a JSON file which I edit manually but I'll set up a MongoDB instance soon. I'd like to self host this as a microservice. ",
                "Also, I would like to add a CI/CD pipeline. Again, this would need a much more powerful server which can handle builds, tests and deployment. This is completely unnecessary for a blog but would be useful practice.",
                "## Conclusion",
                "This is not a forever solution. It's fairly obvious that I'll need to upgrade. That said, having _a_ solution is more important that _the_ solution right now."
            ]
        },
        {
            "id": "learning-processes-1",
            "title": "My Learning Process - Part 1",
            "date": "9/30/2025",
            "image": "https://w6a1hhcupko92e7d.public.blob.vercel-storage.com/images/learning-process-1.png",
            "article": [
                "## Intro",
                "The point of this blog is to examine what I do and how I can do it better. Currently I'm trying to learn front-end development and so I'm examining the learning process and seeing what I can improve.",
                "Note: I'll use the word 'read' to describe intaking any kind of learning material (video, audio etc).",
                "## Learning Techniques",
                "In school and in life we sometimes come across learning techniques. Techniques include; speed reading, mnemonics, teaching, flash cards, mental models, mind maps, interleaved practice.  These techniques can be effective but sometimes it's hard to see why they work and when to use them.",
                "I know people who swear by flash-cards but I've never seen the appeal.",
                "## How I Learn",
                "I take notes on Obsidian and Practice. It's quite effective. I think it's simple, fast and forces me to think about what I'm reading as I read it. I try to write things in my own words. My main focus is not on speed. My main focus is on thinking about the information I've just read.",
                "I would say I retain about 80% of the information I've learned and with my notes I can look back and see what I've missed.",
                "## Can I Make My Learning better?",
                "I have avoided thinking about my learning processes for a while now. The reason... I am an optimisation junkie. I _love_ to optimise. I like the use the best tools I have in the most effective way. I can get sidetracked by the method and forget about the activity. I'll have to stop myself from thinking 'Is this really the _best_ way of learning this?' or 'are these notes _actually_ helping me learn'. ",
                "Optimisation can get in the way. It has done in the past where I've wasted hours of time 'optimising' _how_ I do homework and end up spending twice as long (or rushing it).",
                "That said, today I'm indulging these thoughts. For one reason, to clear them from my mind. For another, because I probably _should_ improve my learning process.",
                "## So... What's the Point of Writing it Down?",
                "Note taking is a bit strange. A naive man might say, in all sincerity: \"Why do I want to make a copy! I can just use the original!\".",
                "Well... from a certain point of view, he wouldn't be wrong. In fact, ask the average person why they take notes and not have a good answer. Now I've justified the question, here's the answer.",
                "We take notes for 2 main reasons:",
                "-Primary - We can learn better when we actively engage with the material.",
                "-Secondary - We have a record for future reference.",
                "Briefly discussing point 2, the future reference part is less important in 2025 with the internet. However, I like to have a curated set of notes that I can play around with and set up how I like (future blog post???).",
                "So... active engagement is what's important... that's what helps us learn. This explains what we mean by bad note-taking. Bad note-taking is passive. Writing almost exactly what we read is sidestepping the actual learning part. Good note taking is active, meaning that we must actively think about what we just read, process it, and then write down our new thought.",
                "## What is going on in your brain when you learn?",
                "I'm sure there's a psychological or neuro-scientitfic answer to this question. However, for our purposes we need only understand the basics. I couldn't find a diagram or any information on this idea so I made a 'note-taking flowchart'. ",
                "![https://w6a1hhcupko92e7d.public.blob.vercel-storage.com/images/learning1/ideaFormation.jpeg]",
                "Based on the various articles I've read, this is perfect note-taking. Reading and writing down are the inputs and outputs but we have a second and much more important output, 'form memory'. The memory comes as a result of 'understand', 'form idea' and 'translate to text'.",
                "I'll go into a bit more detail about what these 3 steps are.",
                "'Understand' means to interpret the words. In understanding the sentence \"The dog ran up the stairs.\", 'dog' is understood and becomes an idea of a dog. Ran is the idea of motion. and 'up the stairs' adds a destination.",
                "'Form into idea' means to take the parts you've understood and combine them. This will have happened automatically with the previous 'dog' example but for harder subjects, you'll have to use more imagination.",
                "'Translate into text' is the part where you take that idea from the abstract, beautifully vague 'mind's eye' and translate it into a set of words that will reform that idea. It's a good check as to whether the idea is fully formed or missing detail. How often do you start to write something down only to have to look back at what you just read to double check.",
                "## Debugging the whole process of note-taking",
                "So... what can go wrong with this? Where ",
                "Understand can go wrong if you don't know what the words mean, or what the sub-ideas mean. If you are learning about web servers and you don't know how the internet works, you'll not immediately understand the words 'connection' or 'request'. This is also why people who know one programming language can easily learn another. They understand what a \"conditional statement\" means already. If we don't understand the sub-ideas we need to learn those first and come back. Good courses will 'build-up' ideas this way. To debug understanding we should check we know the background material.",
                "Form into Idea usually happens automatically if you fully understand the sentence. However, it requires complete concentration. If we are half-awake and trying to learn about quantum physics, it's not going to go well. That's because forming solid ideas in quantum physics is extremely hard (I did Master's in Physics). To debug idea formation we should try check we aren't tired, distracted or in other ways inhibited. We can also find a different explanation if the presented one isn't working.",
                "Translate into text is also usually automatic if you have a fully formed idea. This step requires a lot of practice though. This is actually a sneaky 'information retrieval' step within the learning process. It serves as both a test of the idea and as a further formation of the memory (as text). To debug text formation we can compare our own words with the material. If too similar, it's likely that we are struggling to translate our idea.",
                "We can also debug the whole process by reading our notes and seeing if it matches with our idea, if they return the correct answers to questions.",
                "## Information Retrieval",
                "Information Retrieval can be thought of as the opposite of learning. The point of learning is that later we can retrieve it. Hence, it only makes sense to think about output when looking at input.",
                "With information retrieval we have another flow chart. It's arguably a lot more complex than this but here is the basic process.",
                "![https://w6a1hhcupko92e7d.public.blob.vercel-storage.com/images/learning1/questionToAnswer.jpeg]",
                "We won't go too deep into this process (another future article???). The main thing to see here is the similarity to the note-taking flow. We have the same 'translate into text' step as before. In fact, it's a near identical process. ",
                "Also, we have to 'link ideas together' which is the formation of an idea. The difference with note-taking is that the idea in note-taking is 'the idea' from the material whereas here it's an idea we created ourselves. ",
                "To access to the memory information from the question, we need to have mentally linked the idea in the question to the memories we have in our brain. This means we not only need to have learned the information but have linked it with related ideas. I'll discuss this is part 2.",
                "## Conclusion to Part 1",
                "So learning can be thought of as turning other people's ideas (presented in material) into our ideas and then into memory. The process active reading is thinking other people's thoughts. Our memories are able to be extended to the memories of those we read of and talk to. From this, we are able to form vastly more powerful ideas.",
                "There will be a part 2 to this blog article discussing linking ideas, how I might adapt my note-taking process and the merits of some other learning methods. I'll also try to extend my model to linking ideas which might be considered the difference between knowledge and intelligence."
            ]
        },
        {
            "id": "networking",
            "title": "Networking (is) for Dummies",
            "date": "10/5/2025",
            "image": "https://w6a1hhcupko92e7d.public.blob.vercel-storage.com/images/networking.png",
            "article": [
                "## Introduction",
                "A lot of platitudes get said about _'networking'_. You hear quotes such as _\"Your net worth is only as good as your network\"_ - Rishi Chowdhury or, as I prefer, the somewhat nonsensical _\"Your network IS your net worth\"_ - Tai Lopez. ",
                "Saying a lot without saying very much seems to be the dominant way to speak about networking. You can write your own paint-by-numbers networking article if you like! Just mention phrases like 'inner circle' and 'it's all about who you know'.",
                "That said, I _can_ see the value of networking. Let's say you wanted to film a video but needed a camera operator and a second actor. Could you find the right people? Would you be able to do it next weekend? Would you be able to do it for _free_?",
                "The promise of having strong interpersonal networks is that it allows us to accomplish more than we are able to individually.",
                "## Why I dislike the word 'Networking'",
                "The image that comes to mind when I think about networking is a salesman _schmoozing_ with the bosses trying to get first in line for a promotion.",
                "![https://w6a1hhcupko92e7d.public.blob.vercel-storage.com/images/networking.png]",
                "After asking others, I found that a lot of people think this way. In fact, there is truly a stigma about actively networking. If you don't work in sales, the term just isn't a positive one.",
                "That being said, as I've been looking for a job recently, it would be useful to know more people who can give me guidance on the best opportunities. I want a better network. That requires me to work out exactly how to network and the aforementioned articles have been less than helpful in that regard.",
                "As a logical thinker, I would like something more concrete than 'go network' or 'use your friends'. My answer is to make a working model. Then, use this to network more effectively.",
                "## The Prize for Networking",
                "Though it may be obvious to most, it's useful to clarify what the point of networking is. According to real data, good professional networkers;",
                "- are higher paid,",
                "- find jobs that _aren't_ advertised,",
                "- get more promotions,",
                "- develop more skills by learning from others,",
                "- and more easily get help when needed.",
                "These are all good things. They also make logical sense; you can't get a job you don't know about and you can't learn skills from someone you don't know. Hence, if I can think of networking logically, I can construct a logical model. ",
                "![https://w6a1hhcupko92e7d.public.blob.vercel-storage.com/images/networking/benefits.jpeg]",
                "A flow diagram makes sense here because I'm looking for steps to build a network. ",
                "## What's the key to opening doors?",
                "Meeting people is also obvious as the way to add to one's network. For completeness and according to real data, good networkers;",
                "- have a goal in mind when speaking to people,",
                "- tell people about their intentions,",
                "- send casual LinkedIn messages frequently,",
                "- attend in-person events routinely,",
                "- follow up on leads,",
                "- and provide value when asked.",
                "Again, these items make logical sense. Meeting people is the only way to expand your network and that's what happens at events. Following up on _'leads'_ (another word I hate) will keep you in their mind. Being honest with people builds trust which cements a relationship. So... we can add these as inputs to our model.  ",
                "![https://w6a1hhcupko92e7d.public.blob.vercel-storage.com/images/networking/inputsAndOutputs.jpeg]",
                "We _could_ stop here and use this model but it lacks a bit of depth. Currently LinkedIn Messages lead to a network which leads to money. Not a great working model.",
                "## Shallow and deep connections",
                "A final piece I will add is that not all connections are the same. Some are people you met once and some are coworkers you see 5 days a week. As such, it would make sense to add this final piece to our model.",
                "For simplicity, I'll divide these connections into the categories of 'shallow' and 'deep' (aka inner and outer circle). Looking at our desired outputs again, it's unlikely you'll get a job or help from someone you met once, but it's very likely from a close friend. As such, our outputs are really only related to our 'deep' connections. ",
                "I've also added a filtering process for in our network we should focus on. We can't be friends with everyone and some people are simply more _'useful'_ than others. ",
                "![https://w6a1hhcupko92e7d.public.blob.vercel-storage.com/images/networking/fullDiagram.jpeg]",
                "Also, I found it useful to split the inputs into those which create shallow connections and those that transform shallow connections into deeper connections. We don't need to give a person life-changing advice to add them on our LinkedIn, for example.",
                "## Conclusion",
                "My model is complete. I've distilled a dozen articles on networking down to flow chart. I think it all makes logical sense and I'll be happy to test it out. The main assumption here is that once people get close to you, they want to help which is a pretty reasonable assumption.",
                "The next stage in my networking journey is to actually go out and do the work. It's obviously more complex than a flow chart. On the other hand, sailing is more complicated than the map but you still want the map."
            ]
        },
        {
            "id": "documentation",
            "title": "The Perfect Documentation",
            "date": "10/10/2025",
            "image": "https://w6a1hhcupko92e7d.public.blob.vercel-storage.com/images/documentation.png",
            "article": [
                "## Introduction",
                "Programmers are natural optimisers. We want to optimise everything and remove unnecessary steps of any repetitive process. A lot of codebases don't have documentation. The majority of documentation is bad. Most is worthless due to being uselessly out of date and/or hopelessly incomplete. Most of the time, it's more useful to read code than to read documentation. ",
                "In this blog article, I'll aim to seek the formula for perfect code documentation. I will be specifically referring to internal developer documentation. This is (in my opinion) the most challenging documentation to write. The same practices can be applied elsewhere.",
                "## Documentation Aims",
                "So documentation is for explaining code... not very a very usable system. The question then becomes: 'how should the documentation explain code?'",
                "We want to communicate complex ideas which can not easily be seen from within the lines of code. I would categorise these ideas into 3 distinct categories; Systems, Features and Rules. ",
                "Systems are large parts of the codebase that use many features for a single purpose.",
                "Features are bigger than a function but performs a single task.  ",
                "Rules are rules. ",
                "## System Documentation",
                "Systems such as the 'frontend tech stack' or the 'deployment pipelines' will be largely unchanging from week to week. Systems require in-depth explanations including diagrams and design justifications.",
                "High level documentation is mainly useful for new developers to get them up to speed with the main concepts of a codebase. With this as a structure, the features make more sense.",
                "When a system is re-architected, the system documentation can be referenced. If a justification is no longer valid, it stands that a change should be made.",
                "In terms of the ROI for documentation, this is probably the best onboarding investment a software team can make.  ",
                "## Feature Documentation",
                "Features such as 'Search Database' and 'Validate Form' are classified as such because they perform a single task. Though simple features need not be always be documented, a complex feature can be quickly explained to a developer in order to save them time reading through code. ",
                "The main content of a feature document will be a brief explanation of the task, then an overview of how that task is achieved with reference to function names. ",
                "Additionally, a good feature document can explain justification for its design decisions and how to extend the feature  where appropriate.",
                "## Rules Documentation",
                "Without rules, a codebase can become disjointed. Unlike a book, there are multiple authors and they all have their own ideas as to what is 'good'. It's more important to have rules than to what the rules actually are. Rules should be made about how to;",
                "- style code",
                "- split up git commits (e.g. commits should pass all tests) ",
                "- format new documentation",
                "- write new tickets",
                "- write new tests.",
                "Mostly, rules document non-functional requirements for code. If rules are followed, the codebase is clear, consistent and easily readable.",
                "## A note on 'Self-Documenting' code",
                "Clean code is great. We all love code that explains what it does. However, 'self-documenting' code is a bit of a misnomer. It isn't it's own documentation. It's more accurately self-commenting code. Well written code replaces the need for _most_ comments. I'll henceforth be referring to it as 'self-commenting' code. ",
                "Admittedly, having 'clean code' is a much bigger optimisation than documentation.",
                "## The Perfect Documentation",
                "The Perfect Documentation, in my estimation, is documentation which stands on it's own without code. You should be able to navigate and read the documentation before reading any code and understand what the software is doing. After reading it, you will then be well equipped to work with the code.",
                "The perfect documentation does not need to be exhaustive but it should aim to be above all... useful.  Code is read more than it is written and documentation aims to reduce how much code we need to read.  So... to reduce code-reading is to save time. Documentation is not a waste of time... it's just a waste of time if it's useless."
            ]
        },
        {
            "id": "break-down-work",
            "title": "Why Breaking Down Work Speeds Up Development",
            "date": "10/15/2025",
            "image": "https://w6a1hhcupko92e7d.public.blob.vercel-storage.com/images/break-down-work.png",
            "article": [
                "\"Everything Should Be Made as Simple as Possible, But Not Simpler\" - Albert Einstein. We like to talk about simplicity in programming. 'Simplicity is good.' 'We can simplify that solution.' In actual fact, simplicity is impossible. A solution is unable to simpler than the problem.",
                "When we accept that our code will be complex we can then consider how to make it easier to code. Simpler functions are simpler to code, maintain and test. What we want to create is not simpler code, but rather simpler components.",
                "In this article I will discuss the meaning of software architecture and leadership principles along with discussion of the ideal 'ticket'.",
                "## Don't Try to Eat a Cow",
                "We wouldn't want to eat a cow. We want to eat a burger, a steak etc. As such, the first step of eating a cow is to butcher it, after which we can worry about eating it.",
                "![https://w6a1hhcupko92e7d.public.blob.vercel-storage.com/images/breakDownWork/cowEater.jpg]",
                "Our coding approach needs to try to break the big chunks into smaller chunks. An essential stage of development is to break down a problem. ",
                "Breaking down work is usually not an easy task. It requires a deep understanding of the problem, software design, existing technology and what's realistically achievable. This practice is known as software architecture and is a key role in software development.",
                "When thinking about software, we have different levels of detail. From the very high level ideas (Big-Picture) such as Micro-services, Zero-trust and Event-Driven Design to low level ideas (Implementation) such as Algorithms, Data structures and Functions. ",
                "An architect can take high level ideas and turn them into low-level tasks. An example might be to go from \"Find the optimal route for the driver\" to \"Use Dijkstra's algorithm with the map as a set of nodes and vectors\". ",
                "",
                "Note: Creating increasingly simple sub-problems has diminishing returns. There comes a point where a problem is 'simple enough'. ",
                "## How to Break Down Work (Design Patterns)",
                "Breaking down work is usually not straight forward. It sometimes seems simple in retrospect and was anything but. An architect might iterate on a solution dozens of times to come up with their best one. ",
                "Starting with a blank page isn't a reliable approach to software projects. A solution might have unexpected problems and pitfalls which the designer does not foresee. The best way to map of design patterns!",
                "![https://w6a1hhcupko92e7d.public.blob.vercel-storage.com/images/breakDownWork/pirate.jpg]",
                "Design patterns are abstract solutions to common problems with design implementations left up to the user. The idea of design patterns is that someone has solved something similar to this before and they've navigated all of the pitfalls and complexities. We don't know what we don't know but following a set pattern will serve as a good foundation (assuming we are using the pattern correctly).",
                "The final result of all of this design work should be a list of tickets. A ticket is a self contained piece of work, containing requirements and recommendations. There exist structures for writing tickets but the main goal is to give a developer all of the information they need to complete a piece of work. ",
                "## Completing tickets",
                "The work up to the point a ticket is allocated is largely conceptual. The job of the end developer is to turn these words into working code. From reading a ticket, you'll have a decent idea of where to begin. Along with your development experience, you can use google, your colleagues and, of course, the person who wrote the ticket to gather all the knowledge you need to succeed. ",
                "A good leadership team can get fresher team members up to speed with easier tickets, giving the more difficult ones to more experienced team members. All tickets should aim to be within the grasp of the developer assigned them. ",
                "If no 'easy' tickets exist we can create them by further breaking down 'hard' tickets. Instead of a whole new feature, developing part of a feature is still useful but many design decisions will be made in creating this which a more experienced person should be making. ",
                "When all tickets are assigned and completed with minimal confusion, wasted effort and meetings, a team of developers is operating at maximum efficiency. Whilst this is difficult to achieve it's a sign of great management that your developers are happy and getting through work at a predictable rate. ",
                "On a personal note, I've been the victim of bad tickets several times. From being given a giant new feature with literal weeks of experience to being given impossible tasks (the GUI framework had an unsolvable bug), bad tickets have cumulatively resulted in months of wasted time and frustration with engineers who made them. ",
                "## Conclusion",
                "Leadership is hard. Whilst poor leadership will sometimes be made up for by talented engineers, good leadership can nearly guarantee a project's success. Great leaders make their employee's work a priority over their own and many higher-up engineers don't code very often for this reason. ",
                "Although this article has spoken about leaders being architects, anyone can benefit from learning to architect code. The developer who spends days diagramming, prototyping and consulting with others before diving into code will save incalculable hours of debugging later on. That's software architecture and as more code is written than ever before, it's an invaluable skill. "
            ]
        },
        {
            "id": "testing",
            "title": "Tips for Updating Your Testing",
            "date": "12/20/2025",
            "image": "https://w6a1hhcupko92e7d.public.blob.vercel-storage.com/images/testing.jpg",
            "article": [
                "## Intro",
                "Testing is often ignored as a 'boring' or 'side-project' in software development. However, it's a powerful tool to improve code speed through giving visibility of bugs as we code.",
                "A good testing tool will give a developer near-instant understanding of when code is breaking logic, causing poor performance or changing behavior of the program. The programmer can fix the majority of bugs before the code is ever merged into the branch.",
                "## Easy wins",
                "A test suite should be easy to run, fast to complete and give readable outputs of what's broken. Simply, getting programmers to actually use the test suite is the first win.",
                "Winning the war against amounting bugs is a series of battles. If you ignore the bugs, they will get harder and harder to debug. It's common for more time to be spent debugging than producing code at tech companies. Testing therefore should be a priority. Spending months of development time on this may seem like a waste of time but think about the time saved from developers instantly knowing how to fix bugs that they'd otherwise miss and not understand later on.",
                "## Labels",
                "In order to fix a problem we need to understand it. Labelling tests is a key part of making a test framework understandable, both to the maintainers and to the users. If we don't know what the tests all do, we can't actually improve them. ",
                "If we know what a test does, we can rename it something useful, along with adding a detailed description to the test readme (do this).",
                "Our outputs will instantly become more useful for everyone involved and this then leads us into structuring our tests. Creating folders to separate out tests (such as GUI tests or algorithm tests) will add even more ability to understand our outputs. ",
                "With our new labels, we might find out that our algorithm refactor changed the output to all the \"sorted_X\" labelled tests, meaning we have made a mistake with the sorting refactor and can now fix it.",
                "## Speed ",
                "Speed is next on our priority, we might know what our tests do but not be able to run the tests in a reasonable length of time. Deleting tests will speed this up but it's more than likely that (at least for now) it's not worth doing. Instead, we want to understand which tests take the most time.",
                "This is spreadsheet time, and the output will be separating the 'light' tests from the 'heavy' tests. Once we have a cutoff set, we can make our light-tests run and our heavy-test run. Users can run the 'light' tests on their machines whilst they get up and go grab a drink or go out for lunch. The 'heavy' tests might take overnight (and super-heavy) might be run over a weekend. These are run on servers and are not expected for users to need to run often. ",
                "## Easy",
                "The tests need to be easy to run. Give the users tools to run tests. This might be the hardest part of the project, as you might need to set up remote servers which users can upload code to. Ideally, the users can run tests on their laptops.",
                "## Visibility",
                "The next thing we want to add to our test framework is better visibility. If we can't see something, we can fix it. We have clearly labelled tests and know what's being tested. From here on, the game is to add tests for everything that code that isn't being tested. ",
                "Here we need to bring our codebase knowledge and test suite knowledge together to see what's missing. This should be a team effort with each team member's expertise being brought into the fold. What's a test that we can make that isn't currently in the suite?",
                "As metrics go, test coverage is a bit useless, we can cover all our code but the tests might only test one way they work. Being intelligent and prioritising critical (or newer) code is key to making the most of our time.",
                "## Good tests",
                "Writing tests is a skill. To make good tests, we need rules as to what a test should do.",
                "Single responsibility is a rule which says that a test should only test one thing.",
                "As previously covered, test should be named after what they test.",
                "Test should be as fast as we can make them, meaning smaller inputs are preferable (except in specific testing).",
                "Finally, tests should be stable. Flaky tests and tests that crash often are a real problem for out test suite. This is sometimes unavoidable, such as with very long tests.",
                "## Types of test",
                "Our test suite will contain many different tests. Many different types of test too.",
                "Unit tests - test a unit of code",
                "Performance tests - Test the performance of an algorithm",
                "GUI tests - test the GUI works ",
                "Integration tests - test the code works with the other software",
                "E2E tests - test the code works as a whole",
                "## Test maintainance",
                "When our test suite grows, we might end up with a problem of maintenance. If we have thousands of tests, we will end up with (solvable) problems. ",
                "The first problem will be when we break hundreds of tests with a single change. If we make a big change, there will be a lot of expected failures. In order to cope with this, a tool can be made to mass update tests. This will run each of the failed tests in turn, display the output in a meaningful way, and then allow the user to update the test.",
                "The second problem will be with instability. If we have a lot of tests, we will end up with a lot of failures every time. You can categorise a test as unstable (meaning a single failure should be ignored). ",
                "## The Testing Endgame",
                "An ideal test suite isn't always perfect, but good enough to be trusted most of the time. This means we can use it for a Continuous Integration pipeline into our codebase's main branch. ",
                "This means we trust that code works without much (or any) manual testing required."
            ]
        },
        {
            "title": "NYE 2026 Resolution 1: Blindspot Learning",
            "id": "nye-resolution-1",
            "date": "12/30/2025",
            "image": "https://w6a1hhcupko92e7d.public.blob.vercel-storage.com/images/newYearsResolutions.jpg",
            "article": [
                "The end of another year has come again and I'm now looking back on the year that was. I am spending some time today to think about how I'd like to do better next year. My first thought landed on education. Specifically, what would I go back and learn if I could. The answer wasn't really one thing but rather one area. My blind spots.",
                "## Filling in my blindspots",
                "Apart from making me better at my job, at the moment I'm bad at learning for the sake of self-improvement. I do enjoy learning new things but I don't prioritise that which is optional. In 2026, I'll be trying to fill in some of that which I'd like to know but don't need to know.",
                "The learning topics I've decided on are;",
                "1. Classic Literature",
                "2. Great Artworks",
                "3. History",
                "4. How Modern Technology works",
                "5. Spanish",
                "6. Piano",
                "7. Human Biology",
                "8. Maths",
                "9. Physics",
                "10. Philosophy",
                "## The Plan",
                "By the end of next year, I want to have made a dent in each of these topics. Whilst balancing learning with work, a social life and hobbies might be a challenge, a simple plan is usually a good one.",
                "Books are a great resource for the kind of casual learning I'm planning on. As long as I pick good books with subjects I'm interested in, it won't be hard to keep myself motivated and the momentum going. A book a week might be a little steep but I'll try to keep a good pace.",
                "As for the more involved subjects (Spanish, Piano and Maths), I'll need a more serious approach to learning. The maths is more of a refresher me so I can get along with a textbook and some ruled paper. ",
                "As for Piano, I'd like to get a teacher. The hardest thing with learning something new is getting off the ground in a structured way so I'd like to do grading both in Piano and Music Theory. ",
                "Spanish is also a subject I've tried but never gotten past beginner. I've accepted that I need to spend the money and get a Spanish teacher. Hence, I'll be doing lessons combined with regular practice.",
                "## Keeping myself honest",
                "With self learning, it's quite easy to convince yourself that you're better than you really are. My reality is, I need to be humbled. I need a test to say I'm not good enough and then I'll believe it. For Piano, Maths and Spanish, I can do real tests and get real qualifications. This will be a great way to ensure a real level of competency.",
                "For the reading, I think a 1000 word essay is a good way to go. By writing after reading, I can see what I remember and what I didn't. AI is actually a really good tool here as I can get a free grade on my essays.",
                "## The reading list",
                "With all of this, we need a list of books to work through. The 2026 reading list will be an ongoing concern but I think starting with 10 (one from each category) is a good start.",
                "1. Brave new world - Aldous Huxley (Classic Fiction)",
                "2. Mirror of the World - Julian Bell (Art)",
                "3. Scotland: The Story of a Nation - Magnus Magnusson (History)",
                "4. The Mythical Man-Month - (How tech works)",
                "5. Behave: The Biology of Humans at Our Best and Worst - Human Biology",
                "6. Feynman Lectures of Physics Volume I (Physics)",
                "7. Republic - Plato (Philosophy)",
                "8. The Great Gastby - Classic Fiction",
                "9. Moby Dick - Classic Fiction",
                "10. España: A Brief History of Spain ",
                "## Other Learning materials",
                "Due to the fact that not everything can be learned from books (particularly skills over knowledge), I have a few other learning materials to use.",
                "1. Duolingo App - for Spanish Vocabulary",
                "2. Spanish Tutor - Spanish Learning",
                "3. Piano Teacher - To practice with an expert",
                "4. Physical Piano - To play at home",
                "5. Maths/Physics Problem Sheets - Practicing Problem Solving",
                "## What I hope to be writing about this resolution next year",
                "Assuming this all goes to plan and I become a piano playing, Spanish speaking, reader of 52 books I hope I'll write something about my plans being similar for next year. The hard thing to know is whether this is the right way about things.",
                "I like to have hard goals which are a real accomplishment to achieve. I think achieving this one would be truly life changing. After all, what's the point of a new-year's resolution if you don't resolve to change your year?"
            ]
        }
    ]
}